[
    "Kane at the double as Bayern ease to first-leg win against 10-man Leverkusen",
    "Harvey Elliott stuns PSG as Liverpool weather storm to snatch dramatic win",
    "US stops sharing intelligence on Russia with Ukraine",
    "River campaigners to sue Ofwat over water bill rises",
    "Australia news live: Victoria to tighten bail laws; Cook says his JD Vance ‘knob’ comment was ‘poor’ but popular",
    "Cyclone Alfred live updates: PM says supermarkets and more schools to close, warns storm delay may mean worse damage",
    "Town hall leaders condemn ‘ill-thought-out’ plan to merge English councils",
    "Trump’s veterans affairs chief defends ‘extraordinarily difficult’ plans to cut 80,000 staff – US politics live",
    "Plan to skewer US sanctuary city mayors backfires on Republicans",
    "Appeals court allows removal of head of watchdog agency as legal battle rages over Trump firing",
    "Couple allegedly tried to force their way onto American Airlines flight after missing boarding",
    "Trump administration allows some CFPB work to resume amid court battle, emails show",
    "D.C. mayor says Black Lives Matter street mural near the White House may be removed",
    "Willmar Middle School to perform 'Finding Nemo Jr.'",
    "Trump can remove federal watchdog who fought to reinstate thousands of fired workers, appeals court rules",
    "Stock surge after Trump grants one-month tariff delay for U.S. automakers",
    "House Speaker Johnson's top aide is arrested on charge of driving under the influence, police say",
    "Markets rebound on hopes for tariff relief and government spending plans",
    "'Performance of my life' - Liverpool saved by 'best in world' Alisson",
    "Trump issues 'last warning' to Hamas as US confirms direct hostage talks",
    " Abbey Gate terror suspect makes 1st court appearance following extradition to US",
    " NYPD responds to bomb threat at Barnard College",
    " As many top Democrats stay silent on Cuomo mayoral run, an accuser feels betrayed",
    " Greenland 'cannot be bought,' PM says after Trump speech to Congress",
    " A group funded by Elon Musk is behind deceptive ads in crucial Wisconsin Supreme Court race",
    "Marvel fans get a traumatic twist and new character in 'Daredevil: Born Again' premiere",
    "Musk and GOP Senators discuss pathway to cement DOGE cuts in closed-door meeting",
    "Congressional Republicans 'don’t see a huge appetite' for Trump's push to repeal the CHIPS Act",
    "Why Trump isn't hitting the road after his speech: From the Politics Desk",
    "Trump warns that death awaits Hamas leaders and Gazans if hostages aren't immediately released",
    "USDA ordered to temporarily reinstate thousands of fired employees",
    "From pulpit to protest: What the 40-day boycott of Target is about",
    "U.S. charges alleged hackers in what it calls China-sponsored campaign",
    "Israel outlines plan to control all aid entering Gaza",
    "Democrats, protesters gather at DOGE's 'ground zero' to protest spending cuts",
    "Fox News Politics Newsletter: Supremes Thaw Out Frozen Aid",
    "Abducted boy featured in Netflix 'Unsolved Mysteries' found safe 7 years after capture: 'Overwhelmed with joy'",
    "Vance takes victory lap in border visit as illegal immigrant numbers plummet",
    "Chuck Schumer repeatedly dodges questions about Rep. Al Green screaming at Trump during speech to Congress",
    "House Speaker Mike Johnson's chief of staff arrested for alleged DUI after Trump's address to Congress",
    "Two charged in Kansas City Chiefs fans' deaths 14 months after bodies found frozen in backyard",
    "DJ Daniel visits Trump in Oval Office following joint address honor: ‘One more thing I’ve got for ya’",
    "Greenland, Panama fiercely reject Trump’s ambitions in address to Congress",
    "Tim Tebow teases 1st baby's gender with black-and-white photos before making big announcement",
    "Riley Gaines wants to send a 'thank-you note' to Lia Thomas; here's why",
    "Russian missile experts visited Iran amid growing military ties",
    "Devils star Jack Hughes out for season following hard crash into boards",
    "‘We Have Given Him Everything’: Trump’s Tariffs Stun Mexico",
    "L.A. County Sues Southern California Edison over Eaton Fire",
    "Trump Administration Told to Reinstate Nearly 6,000 Agriculture Dept. Workers",
    "Mayor Eric Adams Grilled by Democrats at ‘Sanctuary City’ Hearing",
    "Trump Administration Is Frustrated Over Pace of Deportations",
    "Senate Confirms Trump Attorney Todd Blanche as No. 2 Justice Dept. Official",
    "With Musk Targeting Social Security, Democrats See a Political Opportunity",
    "Thursday Briefing: How Trump’s Aid Halt May Affect Ukraine",
    "U.S. and Hamas Hold Direct Talks on Hostages in Gaza, Officials Say",
    "Discord in Early Talks With Bankers for Potential I.P.O.",
    "A Straightforward Climate Fix Hits Another Setback",
    "Trump Administration Plans to Eliminate More Than 80,000 Veterans Affairs Employees",
    "What to Know About the Supreme Court Ruling Against Trump’s Foreign Aid Freeze",
    "‘Hamilton’ Cancels Kennedy Center Run Over Trump’s Takeover",
    "California Rain Forecast Has Water Managers ‘Waiting with Bated Breath’",
    "Mayor Mike Johnston of Denver Parries GOP Barbs at ‘Sanctuary City’ Hearing",
    "Carmakers Were Given a Monthlong Reprieve From Tariffs",
    "Republican Senators Question Musk on DOGE Cuts, Gently Insisting on Input",
    "4-Year-Old Boy Dies After Being Found Near Fentanyl at Brooklyn Homeless Shelter",
    "Pakistan Needs Support Fighting Terrorism. A Happy Trump Could Help.",
    "ActBlue, the Democratic Fund-Raising Powerhouse, Faces Internal Chaos",
    "Trump to Pause Auto Tariffs for Canada and Mexico for One Month",
    "Sam Altman, OpenAI CEO, Set to Host Fundraiser for Democrat Senator",
    "Panama, Greenland lash out at Trump's latest push to 'reclaim' them, 'one way or another'",
    "Trump administration has been talking with Hamas, marking U-turn from prior U.S. policy",
    "CIA director confirms pause of U.S. intelligence sharing with Ukraine",
    "Trump Weighs Agriculture Carveouts to Canada, Mexico Tariffs",
    "Alberta to Cut US Alcohol, Change Procurement in Retaliation Against Trump",
    "UK Strikes Data Deal With Ireland in Bid to Lift Energy Security",
    "South Korea’s Inflation Eases as Energy and Food Prices Steady",
    "Trump Warns Hamas of ‘Hell to Pay’ If Hostages Aren’t Freed",
    "Trump’s Tariffs Push Xi to Overhaul China’s Ailing Growth Model",
    "Trump First-Term Economy Chiefs Refrain From Backing Tariff Plan",
    "Trump Congress Speech Gets 36.6 Million Viewers, Tops Biden",
    "Los migrantes indocumentados que construyeron la gigafábrica de Elon Musk",
    "Traders’ Euro Optimism Has a Time Limit, Options Market Shows",
    "Arm CEO on Why the Chipmaker Partnered With Malaysia on $270 Billion Ambition",
    "More Uncertainty Ahead: Fernandez on Trump Tariffs",
    "US Refiners Are Placing Fewer Orders for Mexican Crude Oil",
    "Private Credit Could Help US Lower Its Deficit, HPS’ Puri Says",
    "New Zealand Home Building Declines For Ninth Straight Quarter",
    "Berkshire Wannabes, Tariffs and AI Top Talk of Wall Street Pros",
    "The US Employment Engine Is Beginning to Slow",
    "Ukraine Deal Is About More Than Minerals Rights",
    "Bernanke Says Recent Price Surge May Impact Inflation Control",
    "Nissay Asset Ramps Up Hiring as Alternative Investment Booms",
    "Trump to Delay Auto Tariffs, DOGE Faces GOP Pushback, More",
    "Ares, Indonesia Wealth Fund Partner for Investment Opportunities",
    "Asian Stocks to Climb After Trump Tariff Reprieve: Markets Wrap",
    "Walgreens LBO Tempts Fee-Hungry Banks, Private Credit to Unite",
    "House GOP moves to censure Rep. Al Green for disrupting Trump speech",
    "Trump offers one-month tariff exemption to U.S. automakers",
    "Nancy Pelosi challenger Saikat Chakrabarti says Democrats are out of touch"
]